{
    "economic": [
        {
            "title": "'This too shall pass! What should you do when markets behave like a falling knife?'",
            "link": "https://www.moneycontrol.com/news/business/markets/this-too-shall-pass-what-should-you-do-when-markets-behave-like-a-falling-knife-5057821.html",
            "content": "It is impossible to have timelines in such a global phenomenon, but it would be safe to say that in the next 2-3 months, the spread of the coronavirus should be controlled to a large extent.",
            "date": "March 22"
        },
        {
            "title": "'Taking calculative risks could deliver big return in long term but don't overleverage'",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-calculative-risks-could-deliver-big-return-in-long-term-but-dont-overleverage-5058361.html",
            "content": "On the downside, we expect 7,250 on Nifty in the worst case scenario because in every major ‘bear’ markets, we saw markets correct overall (-40 percent to -50 percent) from the top.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus pandemic: Players should use this break to introspect and stay fit says Pollard",
            "link": "https://www.moneycontrol.com/news/cricket/coronavirus-pandemic-players-should-use-this-break-to-introspect-and-stay-fit-says-pollard-5058881.html",
            "content": "\"It is a good time for introspection, a good time for reflection, a good time to look at where you are as an individual in your career and what you want to achieve going forward\" said Pollard.",
            "date": "March 22"
        },
        {
            "title": "Higher volatility likely to keep traders tensed, better use Option spread",
            "link": "https://www.moneycontrol.com/news/business/markets/higher-volatility-likely-to-keep-traders-tensed-better-use-option-spread-5057501.html",
            "content": "We advise you to stay calm and light in such a market scenario, or better to be with Option spread or strategy rather than looking for a naked position.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus Pandemic | GoAir announces 50% salary cut for top management",
            "link": "https://www.moneycontrol.com/news/business/coronavirus-pandemic-goair-announces-50-salary-cut-for-top-management-5058851.html",
            "content": "GoAir said, “The measures are temporary to combat COVID-19 impact.”",
            "date": "March 22"
        },
        {
            "title": "IT firms still struggling to allow its employees to work from home",
            "link": "https://www.moneycontrol.com/news/business/it-firms-still-struggling-to-allow-its-employees-to-work-from-home-5058111.html",
            "content": "Considering 50 lakh employees are in the IT sector, enabling them to WFH becomes important.",
            "date": "March 22"
        },
        {
            "title": "Corona pandemic I Mumbai health dept asks police to track movements of people who returned from abroad",
            "link": "https://www.moneycontrol.com/news/india/corona-pandemic-i-mumbai-health-dept-asks-police-to-track-movements-of-people-who-returned-from-abroad-5058661.html",
            "content": "Health authorities approach police to ensure people who are self quarantined are confined to home for 15 days; “non-compliance to be dealt very strictly”.",
            "date": "March 22"
        },
        {
            "title": "COAI urges TRAI to consider online open house discussion on 'pressing' floor price issue",
            "link": "https://www.moneycontrol.com/news/business/coai-urges-trai-to-consider-online-open-house-discussion-on-pressing-floor-price-issue-5058791.html",
            "content": "Sources close to the Telecom Regulatory Authority of India (TRAI), however, felt that such a solution may not be practical given that an issue as important as floor price of tariffs, needs to be widely-debated especially with consumer participation at an appropriate time, and not be turned into a hurried and limited exercise.",
            "date": "March 22"
        },
        {
            "title": "Another COVID-19 patient dies in Mumbai; Maharashtra toll reaches 2",
            "link": "https://www.moneycontrol.com/news/india/another-covid-19-patient-dies-in-mumbai-maharashtra-toll-reaches-2-5058781.html",
            "content": "The man was admitted to the H N Reliance Hospital here on Saturday.",
            "date": "March 22"
        },
        {
            "title": "IPL 2020: KKR skipper takes for shadow practice and meditation in self-isolation courtesy of COVID-19",
            "link": "https://www.moneycontrol.com/news/cricket/ipl-2020-kkr-skipper-takes-for-shadow-practice-and-meditation-in-self-isolation-courtesy-of-covid-19-5058701.html",
            "content": "KKR have posted a video of their captain in which he is seen doing shadow practice and meditation.",
            "date": "March 22"
        },
        {
            "title": "IOC becomes first company to begin supply of BS-VI fuel across country",
            "link": "https://www.moneycontrol.com/news/business/ioc-becomes-first-company-to-begin-supply-of-bs-vi-fuel-across-country-5058771.html",
            "content": "\"We have successfully rolled out the supply of BS-VI grade fuel across the country,\" IOC Chairman Sanjiv Singh said.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus impact: World champion, Hamilton goes into self-isolation as precaution against COVID-19",
            "link": "https://www.moneycontrol.com/news/trends/sports-trends/coronavirus-impact-world-champion-hamilton-goes-into-self-isolation-as-precaution-against-covid-19-5058741.html",
            "content": "\"I want to let you know that I am doing well\" Hamilton said in a statement.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus pandemic: IOC asks member countries about COVID-19 impact",
            "link": "https://www.moneycontrol.com/news/trends/sports-trends/coronavirus-pandemic-ioc-asks-member-countries-about-covid-19-impact-5058721.html",
            "content": "\"how do the emergency regulations relating to COVID-19 limit the training and preparation of your athletes?\" - IOC",
            "date": "March 22"
        },
        {
            "title": "Coronavirus pandemic: Spanish athletics join call for Olympic delay",
            "link": "https://www.moneycontrol.com/news/trends/sports-trends/coronavirus-pandemic-spanish-athletics-join-call-for-olympic-delay-5058711.html",
            "content": "\"The Board of Directors of the Royal Spanish Athletics Federation, on behalf of the majority of Spanish athletes, is advocating the postponement of the Tokyo 2020 Olympic Games\" the RFEA said in a statement.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus impact: Aussie batsman, Khawaja urges people to take COVID-19 more seriously",
            "link": "https://www.moneycontrol.com/news/cricket/coronavirus-impact-aussie-batsman-khawaja-urges-people-to-take-covid-19-more-seriously-5058691.html",
            "content": "\"The more seriously we take it, then hopefully, the quicker we can get through it and the less amount of lives that are affected both medically and financially. We need to think about others, not just ourselves\" Khawaja tweeted.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus impact: Tenants occupying co-working spaces ask for flexible terms following pandemic",
            "link": "https://www.moneycontrol.com/news/business/real-estate/coronavirus-impact-tenants-occupying-co-working-spaces-ask-for-flexible-terms-following-pandemic-5058481.html",
            "content": "Co-working operators say that they have not yet received requests for refunds but start-ups that occupy seats in the open plan have requested for terms to be renegotiated.",
            "date": "March 22"
        },
        {
            "title": "China was very secretive on coronavirus, went through hell: Trump",
            "link": "https://www.moneycontrol.com/news/world/china-was-very-secretive-on-coronavirus-went-through-hell-trump-5058801.html",
            "content": "Speaking at a press briefing here on Saturday, Trump denied reports that the US intelligence reports in January and February had warned of a coming pandemic, saying America did not know about the outbreak until it started coming out publicly.",
            "date": "March 22"
        },
        {
            "title": "COVID-19 deaths surge past 13,000 as one billion confined to homes",
            "link": "https://www.moneycontrol.com/news/world/covid-19-deaths-surge-past-13000-as-one-billion-confined-to-homes-5058631.html",
            "content": "The raging pandemic has forced lockdowns in 35 countries across the globe, disrupting lives, travel and businesses as governments scramble to shut borders and unleash hundreds of billions in emergency measures to avoid a widespread virus-fuelled economic meltdown.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus pandemic | Car, bike factories in Pune shut till March 31; Mercedes, Fiat, JCB join the league",
            "link": "https://www.moneycontrol.com/news/technology/auto/coronavirus-pandemic-car-bike-factories-in-pune-shut-till-march-31-mercedes-fiat-jcb-join-the-league-5058541.html",
            "content": "More than two dozen Covid-19 positive cases have been reported from the twin cities of Pune and Pimpri-Chinchwad in Maharashtra",
            "date": "March 22"
        },
        {
            "title": "Coronavirus: Equity mutual funds give 25% negative returns to investors",
            "link": "https://www.moneycontrol.com/news/business/markets/coronavirus-equity-mutual-funds-give-25-negative-returns-to-investors-5058621.html",
            "content": "The 44-player mutual fund industry is not immune to the economic blowback of COVID-19, and going ahead, small and mid-cap equity schemes will continue to remain under pressure in the short to medium term on account of volatility in the markets, said Krishna Karwa, Senior Research Analyst, at iFAST Financial India.",
            "date": "March 22"
        },
        {
            "title": "Stay at home and save lives: President Trump",
            "link": "https://www.moneycontrol.com/news/world/stay-at-home-and-save-lives-president-trump-5058611.html",
            "content": "As of Saturday, there were at least 26,574 confirmed cases of the deadly coronavirus in the US, an increase of more than 7,000 in a day alone.",
            "date": "March 22"
        },
        {
            "title": "Market Week Ahead: 10 key factors that will keep traders busy this week",
            "link": "https://www.moneycontrol.com/news/business/markets/market-week-ahead-10-key-factors-that-will-keep-traders-busy-this-week-3-5058281.html",
            "content": "Needless to say, global cues and developments around the coronavirus pandemic would dictate the market trend ahead also,\" Ajit Mishra of Religare Broking said.",
            "date": "March 22"
        },
        {
            "title": "China central bank official calls for stepped-up global policy coordination",
            "link": "https://www.moneycontrol.com/news/world/china-central-bank-official-calls-for-stepped-up-global-policy-coordination-5058821.html",
            "content": "Chen Yulu, a deputy governor at the People's Bank of China (PBOC), also told a news conference that PBOC Governor Yi Gang had exchanged views with U.S. Federal Reserve Chairman Jerome Powell, the International Monetary Fund and other agencies.",
            "date": "March 22"
        },
        {
            "title": "Australia adds $38 billion in stimulus, considers 'draconian' steps to curb coronavirus",
            "link": "https://www.moneycontrol.com/news/world/australia-adds-38-billion-in-stimulus-considers-draconian-steps-to-curb-coronavirus-5058811.html",
            "content": "Australia has recorded seven deaths linked to COVID-19, and registered 1,098 confirmed cases of the virus.",
            "date": "March 22"
        },
        {
            "title": "COVID-19: China reports first local case after three days, witnesses surge in imported infections",
            "link": "https://www.moneycontrol.com/news/world/covid-19-china-reports-first-local-case-after-three-days-witnesses-surge-in-imported-infections-5058591.html",
            "content": "China's National Health Commission (NHC) said that 46 new confirmed cases were reported on the mainland on Saturday, including one domestic infection transmitted by imported cases in Guangzhou.",
            "date": "March 22"
        },
        {
            "title": "Italy reports almost 800 new virus deaths, new daily record",
            "link": "https://www.moneycontrol.com/news/world/italy-reports-almost-800-new-virus-deaths-new-daily-record-5058421.html",
            "content": "The number of COVID-19 infections rose by 6,557 to 53,578, another record.",
            "date": "March 22"
        },
        {
            "title": "First coronavirus case reported in Andhra Pradesh",
            "link": "https://www.moneycontrol.com/news/india/first-coronavirus-case-reported-in-andhra-pradesh-5058441.html",
            "content": "The man flew from Paris to Delhi on March 15 and then to Hyderabad and Vijayawada on March 17, officials said.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus cases rise to 315 in India: Health Ministry",
            "link": "https://www.moneycontrol.com/news/india/coronavirus-cases-rise-to-315-in-india-health-ministry-5058401.html",
            "content": "\"Total number of confirmed cases so far in the country as on 21 March including foreign nationals is 315,\" the Health Ministry said late Saturday.",
            "date": "March 22"
        },
        {
            "title": "Allocate capital in equities which is not required for the next 3 years: Neelesh Surana",
            "link": "https://www.moneycontrol.com/news/business/markets/allocate-capital-in-equities-which-is-not-required-for-the-next-3-years-neelesh-surana-5056251.html",
            "content": "These are indeed unprecedented times, and it’s important to maintain asset allocation discipline. Valuations are attractive, we would recommend investors should capitalise on increasing allocation.",
            "date": "March 22"
        },
        {
            "title": "Maharashtra govt announces effective shut-down of Mumbai local trains",
            "link": "https://www.moneycontrol.com/news/india/maharashtra-govt-announces-effective-shut-down-of-mumbai-local-trains-5058431.html",
            "content": "The restriction, which will effectively shut down the train services, Mumbai's lifeline, will come into effect from midnight of Sunday, March 22, the release said.",
            "date": "March 22"
        },
        {
            "title": "Covid-19: Mumbaikars stay indoors as 'Janata curfew' commences",
            "link": "https://www.moneycontrol.com/news/india/covid-19-mumbaikars-stay-indoors-as-janata-curfew-commences-5058391.html",
            "content": "Modi has proposed the day-long curfew between 7 am and 9 pm as part of social distancing to check the spread of the deadly virus.",
            "date": "March 22"
        },
        {
            "title": "Coronavirus LIVE updates: Railways cancels all passenger trains till March 31",
            "link": "https://www.moneycontrol.com/news/india/coronavirus-live-updates-narendra-modi-janata-curfew-maharshtra-kerala-mumbai-local-trains-closed-rajasthan-delhi-covid19-tally-5058381.html",
            "content": "LIVE coverage of the coronavirus pandemic and the situation arising out of that.",
            "date": "March 22"
        },
        {
            "title": "Investing in the time of coronavirus: How to play in such markets?",
            "link": "https://www.moneycontrol.com/news/business/markets/investing-in-the-time-of-coronavirus-how-to-play-in-such-markets-5057321.html",
            "content": "Neelesh Surana of Mirae Asset Investment Managers said discipline of asset allocation should be maintained given that coronavirus is an evolving situation.",
            "date": "March 22"
        },
        {
            "title": "DeeMoney teams up with Ripple to power faster, cheaper cross-border money transfers",
            "link": "https://www.moneycontrol.com/news/business/fintech-deemoney-teams-up-with-ripple-to-power-faster-cheaper-cross-border-money-transfers-5058331.html",
            "content": "DeeMoney is currently using RippleNet to process inbound payments into Thailand; namely between the prominent remittance corridors from South Korea, Indonesia, Singapore, Israel as well as the Middle East and Gulf regions.",
            "date": "March 21"
        },
        {
            "title": "Coronavirus impacts finances of more than 60% of Americans: LendingTree Survey",
            "link": "https://www.moneycontrol.com/news/business/fintech-coronavirus-impacts-finances-of-more-than-60-of-americans-lendingtree-survey-5058321.html",
            "content": "As recession fears mount, nearly 4 in 10 American workers see reduction in wages, hours due to coronavirus pandemic.",
            "date": "March 21"
        },
        {
            "title": "Banking in the ‘cloud’ with Thought Machine",
            "link": "https://www.moneycontrol.com/news/business/fintech-banking-in-the-cloud-with-thought-machine-5058311.html",
            "content": "Established by former Google engineer, Paul Taylor in 2014, Thought Machine’s cloud-based core banking solution—Vault—aims to revolutionize banking",
            "date": "March 21"
        },
        {
            "title": "Coronavirus may disrupt credit card dispute process",
            "link": "https://www.moneycontrol.com/news/business/fintech-coronavirus-may-disrupt-credit-card-dispute-process-5057451.html",
            "content": "MyChargeBack recommends that if consumers are planning to raise disputes with their banks for goods or services not provided they should do so as soon as possible to avoid delays and disappointment.",
            "date": "March 21"
        },
        {
            "title": "Noida: Europe-returned man tests positive for COVID-19, total 5 cases; over 1,600 under surveillance",
            "link": "https://www.moneycontrol.com/news/india/noida-europe-returned-man-tests-positive-for-covid-19-total-5-cases-over-1600-under-surveillance-5058251.html",
            "content": "Of the 289 samples, five have tested positive, 189 negative while results of 96 were awaited",
            "date": "March 21"
        },
        {
            "title": "Pakistan suspends all international flights as coronavirus cases jump to 625",
            "link": "https://www.moneycontrol.com/news/world/pakistan-suspends-all-international-flights-as-coronavirus-cases-jump-to-625-5058151.html",
            "content": "Pak Prime Minister Imran Khan on Friday ruled out total lockdown but asked people to reduce unnecessary travel and go for self-quarantine for at least another 45 days to help tackle the coronavirus crisis",
            "date": "March 21"
        },
        {
            "title": "Coronavirus pandemic: Sonia urges people not to panic, pitches for relief package",
            "link": "https://www.moneycontrol.com/news/india/coronavirus-pandemic-sonia-urges-people-not-to-panic-pitches-for-relief-package-5058271.html",
            "content": "Sonia said that in a nation of 130 crore, only 15,701 samples are reported to have been tested so far, adding despite ample time, early warnings and lessons from other nations, we appear to have under-utilized our public and private sector capacities.",
            "date": "March 21"
        },
        {
            "title": "Madhya Pradesh govt crisis: Rebel Congress MLAs join BJP",
            "link": "https://www.moneycontrol.com/news/politics/madhya-pradesh-govt-crisis-rebel-congress-mlas-join-bjp-5058181.html",
            "content": "The saffron party is likely to stake claim to form the government in Madhya Pradesh.",
            "date": "March 21"
        },
        {
            "title": "Cabinet approves schemes to boost electronics manufacturing with Rs 48,000 cr incentives",
            "link": "https://www.moneycontrol.com/news/business/cabinet-approves-schemes-to-boost-electronics-manufacturing-with-rs-48000-cr-incentives-5058261.html",
            "content": "The government estimates that push for manufacturing of electronics components and electronic chips with create around 6 lakh direct and indirect jobs.",
            "date": "March 21"
        },
        {
            "title": "Coronavirus pandemic: Bollywood to fight it out with Sooryavanshi, '83, Radhe, Laxmmi Bomb, Mumbai Saga, Coolie No. 1",
            "link": "https://www.moneycontrol.com/news/trends/entertainment/coronavirus-pandemic-bollywood-to-fight-it-out-with-sooryavanshi-83-radhe-laxmmi-bomb-mumbai-saga-coolie-no-1-5058211.html",
            "content": "There is a theory going around B-town that Akshay Kumar's Sooryavanshi could even arrive on Eid, and hence clash with Salman Khan-starrer Radhe.",
            "date": "March 21"
        },
        {
            "title": "Coronavirus pandemic| Brokers association seeks 60 day extension of existing policies from IRDAI",
            "link": "https://www.moneycontrol.com/news/business/economy/coronavirus-pandemic-brokers-association-seeks-60-day-extension-of-existing-policies-from-irdai-5058041.html",
            "content": "IBAI has also sought waiving of Section 64VB of Insurance Act that says an insurance policy is not valid unless the policyholder pays premium within the prescribed date.",
            "date": "March 21"
        },
        {
            "title": "Coronavirus pandemic: Cases rise to 283 in India; restrictions imposed in many states",
            "link": "https://www.moneycontrol.com/news/india/coronavirus-pandemic-cases-rise-to-283-in-india-restrictions-imposed-in-many-states-5058231.html",
            "content": "\"The total number of active COVID-19 cases across India stands at 256 so far,\" the ministry said, adding 23 others have been cured/discharged/migrated while four have died.",
            "date": "March 21"
        },
        {
            "title": "Coronavirus pandemic: Dushyant Singh, who dined with COVID-19 positive Kanika Kapoor, tests negative",
            "link": "https://www.moneycontrol.com/news/india/coronavirus-pandemic-dushyant-singh-who-dined-with-covid-19-positive-kanika-kapoor-tests-negative-5058081.html",
            "content": "In a Twitter post, Singh said, \"My report for Covid-19 has come out negative. However, as a precautionary measure, I am in isolation and following all health-related advisories.\"",
            "date": "March 21"
        },
        {
            "title": "Story in a chart | CCI Oscillator suggests buying opportunity in ITC",
            "link": "https://www.moneycontrol.com/news/business/markets/story-in-a-chart-cci-oscillator-suggests-buying-opportunity-in-itc-5058031.html",
            "content": "We recommend buying ITC Limited (ITC) around Rs 165-160 levels with a stop loss of Rs 145 for higher targets of Rs 199.",
            "date": "March 21"
        },
        {
            "title": "Dalmia Bharat board approves Rs 500-cr share buyback proposal",
            "link": "https://www.moneycontrol.com/news/business/dalmia-bharat-board-approves-rs-500-cr-share-buyback-proposal-5058221.html",
            "content": "Dalmia Bharat Ltd currently has a cement manufacturing capacity of 26.5 million tonne per annum.",
            "date": "March 21"
        },
        {
            "title": "No new local COVID-19 cases for 3rd day straight in China; sharp rise in imported ones",
            "link": "https://www.moneycontrol.com/news/world/no-new-local-covid-19-cases-for-3rd-day-straight-in-china-sharp-rise-in-imported-ones-5058241.html",
            "content": "China is speeding up construction on major infrastructure projects to mitigate the economic impact of the novel coronavirus epidemic.",
            "date": "March 21"
        },
        {
            "title": "Worst factored in but a sharp bounce unlikely unless Nifty reclaims 9,500: Umesh Mehta",
            "link": "https://www.moneycontrol.com/news/business/markets/worst-factored-in-but-a-sharp-bounce-unlikely-unless-nifty-reclaims-9500-umesh-mehta-5056181.html",
            "content": "Indian markets are expected to witness a bounce back given all the negativity is already priced in. However, the 9000 levels on the Nifty50, does seem to be a strong resistance level.",
            "date": "March 21"
        }
    ]
}